wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/inc/spim.h
/*----------------------------------------------------------------------------*/
/* SPIM_PHDMAW, SPIM_PHDMAR, SPIM_PHDMM constant definitions                  */
/*----------------------------------------------------------------------------*/
#define PHASE_NORMAL_MODE                   (0x0)   /*!< SPIM_PHDMAW/SPIM_PHDMAR/SPIM_PHDMM: Set Normal Mode for Command/Address/Data Phase. \hideinitializer */
#define PHASE_DUAL_MODE                     (0x1)   /*!< SPIM_PHDMAW/SPIM_PHDMAR/SPIM_PHDMM: Set Dual Mode for Command/Address/Data Phase. \hideinitializer */
#define PHASE_QUAD_MODE                     (0x2)   /*!< SPIM_PHDMAW/SPIM_PHDMAR/SPIM_PHDMM: Set Quad Mode for Command/Address/Data Phase. \hideinitializer */
#define PHASE_OCTAL_MODE                    (0x3)   /*!< SPIM_PHDMAW/SPIM_PHDMAR/SPIM_PHDMM: Set Octal Mode for Command/Address/Data Phase. \hideinitializer */

#define PHASE_ORDER_MODE0                   (0x0)   /*!< SPIM_PHDMAW/SPIM_PHDMAR/SPIM_PHDMM: Set Byte order of program data to SPI Flash is byte0, byte1, byte2, byte3, byte4, byte5, byte6, byte7. \hideinitializer */
#define PHASE_ORDER_MODE1                   (0x1)   /*!< SPIM_PHDMAW/SPIM_PHDMAR/SPIM_PHDMM: Set Byte order of program data to SPI Flash is byte7, byte6, byte5, byte4, byte3, byte2, byte1, byte0. \hideinitializer */
#define PHASE_ORDER_MODE2                   (0x2)   /*!< SPIM_PHDMAW/SPIM_PHDMAR/SPIM_PHDMM: Set Byte order of program data to SPI Flash is byte1, byte0, byte3, byte2, byte5, byte4, byte7, byte6. \hideinitializer */
#define PHASE_ORDER_MODE3                   (0x3)   /*!< SPIM_PHDMAW/SPIM_PHDMAR/SPIM_PHDMM: Set Byte order of program data to SPI Flash is byte6, byte7, byte4, byte5, byte2, byte3, byte0, byte1. \hideinitializer */

#define PHASE_WIDTH_8                       (0x1)   /*!< SPIM_PHDMAW/SPIM_PHDMAR/SPIM_PHDMM: Set 8 bits are transmitted in this phase. \hideinitializer */
#define PHASE_WIDTH_16                      (0x2)   /*!< SPIM_PHDMAW/SPIM_PHDMAR/SPIM_PHDMM: Set 16 bits are transmitted in this phase. \hideinitializer */
#define PHASE_WIDTH_24                      (0x3)   /*!< SPIM_PHDMAW/SPIM_PHDMAR/SPIM_PHDMM: Set 24 bits are transmitted in this phase. \hideinitializer */
#define PHASE_WIDTH_32                      (0x4)   /*!< SPIM_PHDMAW/SPIM_PHDMAR/SPIM_PHDMM: Set 32 bits are transmitted in this phase. \hideinitializer */

/* SPIM_PHDMAR/SPIM_PHDMM read mode opcodes. */
#define PHASE_ENABLE_CONT_READ              (0x01)  /* Continue read mode enable */
#define PHASE_DISABLE_CONT_READM            (0x00)  /* Continue read mode disable */

/* SPIM_PHDMAW/SPIM_PHDMAR/SPIM_PHDMM DTR mode opcodes. */
#define PHASE_ENABLE_DTR                    (0x01)  /* Double data rate mode enable */
#define PHASE_DISABLE_DTR                   (0x00)  /* Double data rate mode disable */

#define SPIM_IO_WRITE_PHASE                 (0x01)  /* SPIM IO write phase mode.  */
#define SPIM_IO_READ_PHASE                  (0x00)  /* SPIM IO read phase mode.  */

/** @cond HIDDEN_SYMBOLS */

typedef enum
{
    MFGID_UNKNOW    = 0x00U,
    MFGID_SPANSION  = 0x01U,
    MFGID_EON       = 0x1CU,
    MFGID_ISSI      = 0x7FU,
    MFGID_MXIC      = 0xC2U,
    MFGID_WINBOND   = 0xEFU,
    MFGID_MICRON    = 0x2CU,
} E_MFGID;

/* Flash opcodes. */
#define OPCODE_WREN             (0x06U) /* Write enable */
#define OPCODE_RDSR             (0x05U) /* Read status register #1*/
#define OPCODE_WRSR             (0x01U) /* Write status register #1 */
#define OPCODE_RDSR2            (0x35U) /* Read status register #2*/
#define OPCODE_WRSR2            (0x31U) /* Write status register #2 */
#define OPCODE_RDSR3            (0x15U) /* Read status register #3*/
#define OPCODE_WRSR3            (0x11U) /* Write status register #3 */
#define OPCODE_PP               (0x02U) /* Page program (up to 256 bytes) */
#define OPCODE_SE_4K            (0x20U) /* Erase 4KB sector */
#define OPCODE_BE_32K           (0x52U) /* Erase 32KB block */
#define OPCODE_BE_64K           (0xD8U) /* Erase 64KB block */
#define OPCODE_CHIP_ERASE       (0xC7U) /* Erase whole flash chip */
#define OPCODE_READ_ID          (0x90U) /* Read ID */
#define OPCODE_RDID             (0x9FU) /* Read JEDEC ID */
#define OPCODE_BRRD             (0x16U) /* SPANSION flash - Bank Register Read command  */
#define OPCODE_BRWR             (0x17U) /* SPANSION flash - Bank Register write command */
#define OPCODE_NORM_READ        (0x03U) /* Read data bytes */
#define OPCODE_FAST_READ        (0x0BU) /* Read data bytes */
#define OPCODE_FAST_DUAL_READ   (0x3BU) /* Read data bytes */
#define OPCODE_FAST_QUAD_READ   (0x6BU) /* Read data bytes */

/* Micron MT35xU02 octal SPI flash configure register OP code */
#define OPCODE_WR_NVCONFIG      (0xB1U) /* Write Non-Volatile Configuration Register*/
#define OPCODE_WR_VCONFIG       (0x81U) /* Write Volatile Configuration Register*/
#define OPCODE_RD_NVCONFIG      (0xB5U) /* Read Non-Volatile Configuration Register*/
#define OPCODE_RD_VCONFIG       (0x85U) /* Read Volatile Configuration Register*/

/* Used for SST flashes only. */
#define OPCODE_BP               (0x02U) /* Byte program */
#define OPCODE_WRDI             (0x04U) /* Write disable */
#define OPCODE_AAI_WP           (0xadU) /* Auto u32Address increment word program */

#define OPCODE_EN4B             (0xb7U) /* Enter 4-byte mode */
#define OPCODE_EX4B             (0xe9U) /* Exit 4-byte mode */

#define OPCODE_RDSCUR           (0x2bU)
#define OPCODE_WRSCUR           (0x2fU)

#define OPCODE_RSTEN            (0x66U)
#define OPCODE_RST              (0x99U)

#define OPCODE_ENQPI            (0x38U)
#define OPCODE_EXQPI            (0xFFU)

/* Status Register bits. */
#define SR_WIP                  (0x1U)  /* Write in progress */
#define SR_WEL                  (0x2U)  /* Write enable latch */
#define SR_QE                   (0x40U) /* Quad Enable for MXIC */

/* Status Register #2 bits. */
#define SR2_QE                  (0x2U)  /* Quad Enable for Winbond */

/* meaning of other SR_* bits may differ between vendors */
#define SR_BP0                  (0x4U)  /* Block protect 0 */
#define SR_BP1                  (0x8U)  /* Block protect 1 */
#define SR_BP2                  (0x10U) /* Block protect 2 */
#define SR_SRWD                 (0x80U) /* SR write protect */
#define SR3_ADR                 (0x01U) /* 4-byte u32Address mode */

#define SCUR_4BYTE              (0x04U) /* 4-byte u32Address mode */

