wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/inc/spim.h
/* SPIM Wait State Timeout Counter. */
#define SPIM_TIMEOUT            0xFFFF //SystemCoreClock /*!< SPIM time-out counter (1 second time-out) */

/** @endcond HIDDEN_SYMBOLS */

/* SPIM Define Error Code */
#define SPIM_OK                 ( 0L)   /*!< SPIM operation OK */
#define SPIM_ERR_FAIL           (-1L)   /*!< SPIM operation failed */
#define SPIM_ERR_TIMEOUT        (-2L)   /*!< SPIM operation abort due to timeout error */

/*----------------------------------------------------------------------------*/
/*  Define Macros and functions                                               */
/*----------------------------------------------------------------------------*/
/**
 * @brief   Enable cipher balance.
 * \hideinitializer
 */
//#define SPIM_ENABLE_BALEN(spim)     (spim->CTL0 |= SPIM_CTL0_BALEN_Msk)

/**
 * @brief   Disable cipher balance.
 * \hideinitializer
 */
//#define SPIM_DISABLE_BALEN(spim)    (spim->CTL0 &= ~(SPIM_CTL0_BALEN_Msk))

/**
 * @brief       Enable Hyper Device Mode.
* \hideinitializer
 */
#define SPIM_SET_FLASH_MODE(spim)   (spim->CTL0 &= ~(SPIM_CTL0_HYPER_EN_Msk))

/**
 * @brief           Set 4-byte address.
 * @param[in]   x   Enable/Disable 4 bytes address.
 *                  - \ref SPIM_OP_ENABLE
 *                  - \ref SPIM_OP_DISABLE
 * \hideinitializer
 */
#define SPIM_SET_4BYTE_ADDR(spim, x) \
    (spim->CTL0 = (spim->CTL0 & ~(SPIM_CTL0_B4ADDREN_Msk)) | \
                  (((x) ? 1UL : 0UL) << SPIM_CTL0_B4ADDREN_Pos))

/**
 * @brief   Get 4-byte address to be enabled/disabled.
 * \hideinitializer
 */
#define SPIM_GET_4BYTE_ADDR(spim)    \
    ((spim->CTL0 & SPIM_CTL0_B4ADDREN_Msk) >> SPIM_CTL0_B4ADDREN_Pos)

/**
 * @brief   Enable SPIM interrupt.
 * \hideinitializer
 */
#define SPIM_ENABLE_INT(spim)       (spim->CTL0 |= SPIM_CTL0_IEN_Msk)

/**
 * @brief   Disable SPIM interrupt.
 * \hideinitializer
 */
#define SPIM_DISABLE_INT(spim)      (spim->CTL0 &= ~(SPIM_CTL0_IEN_Msk))

/**
 * @brief   Get SPIM interrupt to be enabled/disabled.
 * \hideinitializer
 */
#define SPIM_GET_INT(spim)  \
    ((spim->CTL0 & SPIM_CTL0_IEN_Msk) >> SPIM_CTL0_IEN_Pos)

/**
 * @brief   Is interrupt flag on.
 * \hideinitializer
 */
#define SPIM_IS_IF_ON(spim)   \
    ((spim->CTL0 & SPIM_CTL0_IF_Msk) >> SPIM_CTL0_IF_Pos)

/**
 * @brief   Clear interrupt flag.
 * \hideinitializer
 */
#define SPIM_CLR_INT(spim)  (spim->CTL0 |= (1UL << SPIM_CTL0_IF_Pos))

/**
 * @brief       Set transmit/receive bit length.
 * @param[in]   spim
 * @param[in]   x   Transmit/Receive Bit Length
 *                  - \ref 8:  8 bits
 *                  - \ref 16: 16 bits
 *                  - \ref 24: 24 bits
 *                  - \ref 32: 32 bits
 * \hideinitializer
 */
#define SPIM_SET_DATA_WIDTH(spim, x)    \
    (spim->CTL0 = (spim->CTL0 & ~(SPIM_CTL0_DWIDTH_Msk)) | \
                  (((x)-1U) << SPIM_CTL0_DWIDTH_Pos))

/**
 * @brief   Get data transmit/receive bit length setting.
 * \hideinitializer
 */
#define SPIM_GET_DATA_WIDTH(spim)   \
    (((spim->CTL0 & SPIM_CTL0_DWIDTH_Msk) >> SPIM_CTL0_DWIDTH_Pos) + 1U)

/**
 * @brief       Set data transmit/receive burst number.
 * @param[in]   x   Transmit/Receive Burst Number
 *                  - \ref 0: one data TX/RX will be executed in one transfer
 *                  - \ref 1: two data TX/RX will be executed in one transfer
 *                  - \ref 2: three data TX/RX will be executed in one transfer
 *                  - \ref 3: four data TX/RX will be executed in one transfer
 * \hideinitializer
 */
#define SPIM_SET_BURST_DATA(spim, x)    \
    (spim->CTL0 = (spim->CTL0 & ~(SPIM_CTL0_BURSTNUM_Msk)) | \
                  ((x - 1UL) << SPIM_CTL0_BURSTNUM_Pos))

/**
 * @brief   Get data transmit/receive burst number.
 * \hideinitializer
 */
#define SPIM_GET_BURST_DATA(spim)   \
    (((spim->CTL0 & SPIM_CTL0_BURSTNUM_Msk) >> SPIM_CTL0_BURSTNUM_Pos) + 1UL)

/**
 * @brief       Set suspend interval.
 * @param[in]   x   Suspend Interval. It could be 0 ~ 0xF.
 * \hideinitializer
 */
#define SPIM_SET_SUSP_INTVL(spim, x)    \
    (spim->CTL0 = (spim->CTL0 & ~(SPIM_CTL0_SUSPITV_Msk)) | \
                  ((x) << SPIM_CTL0_SUSPITV_Pos))

/**
 * @brief   Get suspend interval setting.
 * \hideinitializer
 */
#define SPIM_GET_SUSP_INTVL(spim)   \
    ((spim->CTL0 & SPIM_CTL0_SUSPITV_Msk) >> SPIM_CTL0_SUSPITV_Pos)

/**
 * @brief   Enable Single Input mode.
 * \hideinitializer
 */
#define SPIM_ENABLE_SING_INPUT_MODE(spim)   \
    (spim->CTL0 = (spim->CTL0 & ~(SPIM_CTL0_BITMODE_Msk | SPIM_CTL0_QDIODIR_Msk)) | \
                  ((SPIM_CTL0_BITMODE_SING << SPIM_CTL0_BITMODE_Pos)| SPIM_CTL0_RW_IN(1)))

/**
 * @brief   Enable Single Output mode.
 * \hideinitializer
 */
#define SPIM_ENABLE_SING_OUTPUT_MODE(spim)  \
    (spim->CTL0 = (spim->CTL0 & ~(SPIM_CTL0_BITMODE_Msk | SPIM_CTL0_QDIODIR_Msk)) | \
                  ((SPIM_CTL0_BITMODE_SING << SPIM_CTL0_BITMODE_Pos) | SPIM_CTL0_RW_IN(0)))

/**
 * @brief   Enable Dual Input mode.
 * \hideinitializer
 */
#define SPIM_ENABLE_DUAL_INPUT_MODE(spim)   \
    (spim->CTL0 = (spim->CTL0 & ~(SPIM_CTL0_BITMODE_Msk | SPIM_CTL0_QDIODIR_Msk)) | \
                  ((SPIM_CTL0_BITMODE_DUAL << SPIM_CTL0_BITMODE_Pos) | SPIM_CTL0_RW_IN(1U)))

/**
 * @brief   Enable Dual Output mode.
 * \hideinitializer
 */
#define SPIM_ENABLE_DUAL_OUTPUT_MODE(spim)  \
    (spim->CTL0 = (spim->CTL0 & ~(SPIM_CTL0_BITMODE_Msk | SPIM_CTL0_QDIODIR_Msk)) | \
                  ((SPIM_CTL0_BITMODE_DUAL << SPIM_CTL0_BITMODE_Pos) | SPIM_CTL0_RW_IN(0U)))

/**
 * @brief   Enable Quad Input mode.
 * \hideinitializer
 */
#define SPIM_ENABLE_QUAD_INPUT_MODE(spim)   \
    (spim->CTL0 = (spim->CTL0 & ~(SPIM_CTL0_BITMODE_Msk | SPIM_CTL0_QDIODIR_Msk)) | \
                  ((SPIM_CTL0_BITMODE_QUAD << SPIM_CTL0_BITMODE_Pos)| SPIM_CTL0_RW_IN(1U)))

/**
 * @brief   Enable Quad Output mode.
 * \hideinitializer
 */
#define SPIM_ENABLE_QUAD_OUTPUT_MODE(spim)  \
    (spim->CTL0 = (spim->CTL0 & ~(SPIM_CTL0_BITMODE_Msk | SPIM_CTL0_QDIODIR_Msk)) | \
                  ((SPIM_CTL0_BITMODE_QUAD << SPIM_CTL0_BITMODE_Pos) | SPIM_CTL0_RW_IN(0U)))

/**
 * @brief   Enable Octal Input mode.
 * \hideinitializer
 */
#define SPIM_ENABLE_OCTAL_INPUT_MODE(spim)  \
    (spim->CTL0 = (spim->CTL0 & ~(SPIM_CTL0_BITMODE_Msk | SPIM_CTL0_QDIODIR_Msk)) | \
                  ((SPIM_CTL0_BITMODE_OCTAL << SPIM_CTL0_BITMODE_Pos) | SPIM_CTL0_RW_IN(1U)))

/**
 * @brief   Enable Octal Output mode.
 * \hideinitializer
 */
#define SPIM_ENABLE_OCTAL_OUTPUT_MODE(spim) \
    (spim->CTL0 = (spim->CTL0 & ~(SPIM_CTL0_BITMODE_Msk | SPIM_CTL0_QDIODIR_Msk)) | \
                  ((SPIM_CTL0_BITMODE_OCTAL << SPIM_CTL0_BITMODE_Pos) | SPIM_CTL0_RW_IN(0U)))

/**
 * @brief       Set operation mode.
 * @param[in]   x   SPI Function Operation Mode
 *                  - \ref SPIM_CTL0_OPMODE_IO
 *                  - \ref SPIM_CTL0_OPMODE_PAGEWRITE
 *                  - \ref SPIM_CTL0_OPMODE_PAGEREAD
 *                  - \ref SPIM_CTL0_OPMODE_DIRECTMAP
 * \hideinitializer
 */
#define SPIM_SET_OPMODE(spim, x)    \
    (spim->CTL0 = (spim->CTL0 & ~(SPIM_CTL0_OPMODE_Msk)) | ((x) << SPIM_CTL0_OPMODE_Pos))

/**
 * @brief   Get operation mode.
 * \hideinitializer
 */
#define SPIM_GET_OPMODE(spim)   \
    ((spim->CTL0 & SPIM_CTL0_OPMODE_Msk) >> SPIM_CTL0_OPMODE_Pos)

/**
 * @brief       Set DTR(Data Transfer Rate) mode.
 * @param[in]   x   Double Transfer Rate Mode Enable Bit for Normal I/O Mode
 *                  - \ref SPIM_OP_ENABLB
 *                  - \ref SPIM_OP_DISABLE
 * \hideinitializer
 */
#define SPIM_SET_DTR_MODE(spim, x)  \
    (spim->CTL0 = (spim->CTL0 & ~(SPIM_CTL0_DTR_NORM_Msk) | \
                   (((x) ? 1UL : 0UL) << SPIM_CTL0_DTR_NORM_Pos)))

/**
 * @brief   Get DTR(Data Transfer Rate) mode to be enabled/disabled.
 * \hideinitializer
 */
#define SPIM_GET_DTR_MODE(spim) \
    ((spim->CTL0 & SPIM_CTL0_DTR_NORM_Msk) >> SPIM_CTL0_DTR_NORM_Pos)

/**
 * @brief       Set Read DQS Mode.
 * @param[in]   x   Read DQS Mode Enable Bit for Normal I/O Mode
 *                  - \ref SPIM_OP_ENABLE
 *                  - \ref SPIM_OP_DISABLE
 * \hideinitializer
 */
#define SPIM_SET_RDQS_MODE(spim, x) \
    (spim->CTL0 = (spim->CTL0 & ~(SPIM_CTL0_RDQS_NORM_Msk)) | \
                  (((x) ? 1UL : 0UL) << SPIM_CTL0_RDQS_NORM_Pos))

/**
 * @brief   Get Read DQS Mode to be enabled/disabled.
 * \hideinitializer
 */
#define SPIM_GET_RDQS_MODE(spim)    \
    ((spim->CTL0 & SPIM_CTL0_RDQS_NORM_Msk) >> SPIM_CTL0_RDQS_NORM_Pos)

/**
 * @brief       Set Read Data Byte Order Mode.
 * @param[in]   x   Received Data Byte Order of Normal I/O Mode for Octal SPI Flash
 *                  width 8bits
 *                  - \ref 0x0 : received data from SPI Flash is byte0.
 *                  width 16bits
 *                  - \ref 0x0 : received data from SPI Flash is byte0, byte1.
 *                  - \ref 0x1 : received data from SPI Flash is byte1, byte0.
 *                  width 24bits
 *                  - \ref 0x0 : received data from SPI Flash is byte0, byte1, byte2.
 *                  - \ref 0x1 : received data from SPI Flash is byte2, byte1, byte0.
 *                  width 32bits
 *                  - \ref 0x0 : received data from SPI Flash is byte0, byte1, byte2, byte3.
 *                  - \ref 0x1 : received data from SPI Flash is byte3, byte2, byte1, byte0.
 *                  - \ref 0x2 : received data from SPI Flash is byte1, byte0, byte3, byte2.
 *                  - \ref 0x3 : received data from SPI Flash is byte2, byte3, byte0, byte1.
 * \hideinitializer
 */
#define SPIM_SET_RBO_MODE(spim, x)  \
    (spim->CTL0 = (spim->CTL0 & ~(SPIM_CTL0_RBO_NORM_Msk)) | (x << SPIM_CTL0_RBO_NORM_Pos))

/**
 * @brief   Get Read Data Byte Order Mode.
 * \hideinitializer
 */
#define SPIM_GET_RBO_MODE(spim) \
    ((spim->CTL0 & SPIM_CTL0_RBO_NORM_Msk) >> SPIM_CTL0_RBO_NORM_Pos)

/**
 * @brief       Set SPI flash commmand code.
 * @param[in]   x   reference SPI Flash Specification.
 * \hideinitializer
 */
#define SPIM_SET_SPIM_MODE(spim, x) \
    (spim->CMDCODE = (spim->CMDCODE & (~SPIM_CMDCODE_CMDCODE_Msk)) | (x))

/**
 * @brief   Get SPI flash command code.
 * \hideinitializer
 */
#define SPIM_GET_SPIM_MODE(spim)    \
    ((spim->CMDCODE & SPIM_CMDCODE_CMDCODE_Msk) >> SPIM_CMDCODE_CMDCODE_Pos)

/**
 * @brief   Start operation.
 * \hideinitializer
 */
#define SPIM_SET_GO(spim)   (spim->CTL1 |= SPIM_CTL1_SPIMEN_Msk)

/**
 * @brief   Is engine busy.
 * \hideinitializer
 */
#define SPIM_IS_BUSY(spim)  \
    ((spim->CTL1 & SPIM_CTL1_SPIMEN_Msk) >> SPIM_CTL1_SPIMEN_Pos)

/**
 * @brief   Wait for free.
 * \hideinitializer
 */
#define SPIM_WAIT_FREE(spim)    \
    while((spim->CTL1 & SPIM_CTL1_SPIMEN_Msk) >> SPIM_CTL1_SPIMEN_Pos)

