wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/inc/spim.h
#if (SPIM_REG_CACHE == 1)    // TESTCHIP_ONLY not support
/**
 * @brief   Invalidate cache.
 * \hideinitializer
 */
#define SPIM_INVALID_CACHE(spim)    (spim->CTL1 |= SPIM_CTL1_CDINVAL_Msk)

/**
 * @brief   Cache Write Through Enable.
 * \hideinitializer
 */
//#define SPIM_ENABLE_CAWRTHEN(spim)    (spim->CTL1 |= SPIM_CTL1_CAWRTHEN_Msk)

/**
 * @brief   Cache Write Through Disable.
 * \hideinitializer
 */
//#define SPIM_DISABLE_CAWRTHEN(spim)    (spim->CTL1 &= ~SPIM_CTL1_CAWRTHEN_Msk)

/**
 * @brief   Cache Auto Selection Updated Cache Line Number Enable.
 * \hideinitializer
 */
//#define SPIM_ENABLE_AUTOSCLN(spim)    (spim->CTL1 |= SPIM_CTL1_AUTOSCLN_Msk)

/**
 * @brief   Cache Auto Selection Updated Cache Line Number Disable.
 * \hideinitializer
 */
//#define SPIM_DISABLE_AUTOSCLN(spim)    (spim->CTL1 &= ~SPIM_CTL1_AUTOSCLN_Msk)

/**
 * @brief   Set Updated Cache Line Number per Cache Miss.
 * @param[in]   x   SPI Function Operation Mode
 *                  - \ref 0x01 : Update one cache line per cache miss. (default)
 *                  - \ref 0x02 : Update two cache line per cache miss.
 *                  - \ref 0x03 : Update three cache line per cache miss.
 *                  - \ref 0x04 : Update four cache line per cache miss.
 * \hideinitializer
 */
#define SPIM_SET_UPDCLNUM(spim, x)    \
    (spim->CTL1 = (spim->CTL1 & ~(SPIM_CTL1_UPDCLNUM_Msk)) | (x) << SPIM_CTL1_UPDCLNUM_Pos)

/**
 * @brief   Reset Updated Cache Line Number per Cache Miss.
 * \hideinitializer
 */
#define SPIM_RESET_UPDCLNUM(spim) (spim->CTL1 &= ~(SPIM_CTL1_UPDCLNUM_Msk))

#endif

/**
 * @brief       Set SS(Select Active) to active level.
 * @param[in]   x   Set Slave Selection
 * \hideinitializer
 */
#define SPIM_SET_SS_EN(spim, x) \
    (spim->CTL1 = (spim->CTL1 & ~(SPIM_CTL1_SS_Msk)) | \
                  ((!(x) ? 1UL : 0UL) << SPIM_CTL1_SS_Pos))

/**
 * @brief   Is SS(Select Active) in active level.
 * \hideinitializer
 */
#define SPIM_GET_SS_EN(spim)    (!(spim->CTL1 & SPIM_CTL1_SS_Msk))

/**
 * @brief   Set active level of slave select to be high/low.
 * \hideinitializer
 */
#define SPIM_SET_SS_ACTLVL(spim, x) \
    spim->CTL1 = (spim->CTL1 & ~(SPIM_CTL1_SSACTPOL_Msk)) | \
                 ((!!(x) ? 1UL : 0UL) << SPIM_CTL1_SSACTPOL_Pos)

/**
 * @brief       Set idle time interval.
 * @param[in]   x   Idle Time Interval. It could be 0 ~ 0xFFFF.
 * \hideinitializer
 */
#define SPIM_SET_IDL_INTVL(spim, x) \
    (spim->CTL1 = (spim->CTL1 & ~(SPIM_CTL1_IDLETIME_Msk)) | \
                  ((x) << SPIM_CTL1_IDLETIME_Pos))

/**
 * @brief   Get idle time interval setting.
 * \hideinitializer
 */
#define SPIM_GET_IDL_INTVL(spim)    \
    ((spim->CTL1 & SPIM_CTL1_IDLETIME_Msk) >> SPIM_CTL1_IDLETIME_Pos)

/**
 * @brief       Set SPIM clock divider.
 * @param[in]   x   Clock Divider Register
 *                  SPI Flash For DTR commands
 *                  - \ref only 1, 2, 4, 8, 16, 32,….
 *                  Hyper Device Mode
 *                  - \ref only support 1 or 2
 * \hideinitializer
 */
#define SPIM_SET_CLOCK_DIVIDER(spim, x) \
    (spim->CTL1 = (spim->CTL1 & ~(SPIM_CTL1_DIVIDER_Msk)) | \
                  ((x) << SPIM_CTL1_DIVIDER_Pos))

/**
 * @brief   Get SPIM current clock divider setting.
 * \hideinitializer
 */
#define SPIM_GET_CLOCK_DIVIDER(spim)    \
    ((spim->CTL1 & SPIM_CTL1_DIVIDER_Msk) >> SPIM_CTL1_DIVIDER_Pos)

/**
 * @brief   Set sampling clock delay selection for received data, It could be 0 ~ 0xF.
 * \hideinitializer
 */
#define SPIM_SET_RXCLKDLY_RDDLYSEL(spim, x) \
    (spim->RXCLKDLY = (spim->RXCLKDLY & ~(SPIM_RXCLKDLY_RDDLYSEL_Msk)) | \
                      ((x) << SPIM_RXCLKDLY_RDDLYSEL_Pos))

/**
 * @brief   Get sampling clock delay selection for received data.
 * \hideinitializer
 */
#define SPIM_GET_RXCLKDLY_RDDLYSEL(spim)    \
    ((spim->RXCLKDLY & SPIM_RXCLKDLY_RDDLYSEL_Msk) >> SPIM_RXCLKDLY_RDDLYSEL_Pos)

/**
 * @brief   Set DMA/DMM mode SPI flash active SCLK time. It could be 0 ~ 0xFF.
 * \hideinitializer
 */
#define SPIM_SET_DMADMM_ACTSCLKT(spim, x)  \
    (spim->DMMCTL = (spim->DMMCTL & ~SPIM_DMMCTL_ACTSCLKT_Msk) | \
                    ((((x) & 0xFUL) << SPIM_DMMCTL_ACTSCLKT_Pos) | SPIM_DMMCTL_UACTSCLK_Msk))

/**
 * @brief   Reset SPI flash active SCLK time.
 * \hideinitializer
 */
#define SPIM_RESET_DMADMM_ACTSCLK(spim)    (spim->DMMCTL &= ~(SPIM_DMMCTL_UACTSCLK_Msk))

/**
 * @brief   Set DMM mode SPI flash deselect time. It could be 0 ~ 0xFF.
 * \hideinitializer
 */
#define SPIM_SET_DMM_DESELTIM(spim, x)  \
    (spim->DMMCTL = (spim->DMMCTL & ~SPIM_DMMCTL_DESELTIM_Msk) | \
                    (((x)&0x1FUL) << SPIM_DMMCTL_DESELTIM_Pos))

/**
 * @brief   Get current DMM mode SPI flash deselect time setting.
 * \hideinitializer
 */
#define SPIM_GET_DMM_DESELTIM(spim) \
    ((spim->DMMCTL & SPIM_DMMCTL_DESELTIM_Msk) >> SPIM_DMMCTL_DESELTIM_Pos)

/**
 * @brief   Enable DMM burst wrap mode.
 * \hideinitializer
 */
#define SPIM_ENABLE_DMM_BWEN(spim)  (spim->DMMCTL |= SPIM_DMMCTL_BWEN_Msk)

/**
 * @brief   Disable DMM burst wrap mode.
 * \hideinitializer
 */
#define SPIM_DISABLE_DMM_BWEN(spim) (spim->DMMCTL &= ~(SPIM_DMMCTL_BWEN_Msk))

/**
 * @brief   Get DMM burst wrap mode
 *
 */
#define SPIM_GET_DMM_BWEN(spim) \
    ((spim->DMMCTL & SPIM_DMMCTL_BWEN_Msk) >> SPIM_DMMCTL_BWEN_Pos)

/**
 * @brief   Enable DMM mode continuous read mode.
 * \hideinitializer
 */
#define SPIM_ENABLE_DMM_CREN(spim)  (spim->DMMCTL |= SPIM_DMMCTL_CREN_Msk)

/**
 * @brief   Disable DMM mode continuous read mode.
 * \hideinitializer
 */
#define SPIM_DISABLE_DMM_CREN(spim) (spim->DMMCTL &= ~(SPIM_DMMCTL_CREN_Msk))

/**
 * @brief   Set dummy cycle number (Only DMA Command Mode). It could be 0 ~ 0xFF.
 * \hideinitializer
 */
#define SPIM_SET_DMAR_DC(spim, x)   \
    (spim->CTL2 = (spim->CTL2 & ~(SPIM_CTL2_DC_DMAR_Msk)) | \
                  ((x) << SPIM_CTL2_DC_DMAR_Pos))

/**
 * @brief   Clear dummy cycle number (Only DMA Command Mode).
 * \hideinitializer
 */
#define SPIM_CLEAR_DMAR_DC(spim)    (spim->CTL2 &= ~(SPIM_CTL2_DC_DMAR_Msk))

/**
 * @brief   Set dummy cycle number (Only DMM Command Mode). It could be 0 ~ 0xFF.
 * \hideinitializer
 */
#define SPIM_SET_DMM_DC(spim, x)    \
    (spim->CTL2 = (spim->CTL2 & ~(SPIM_CTL2_DC_DMM_Msk)) | \
                  (((x) & 0xFFUL) << SPIM_CTL2_DC_DMM_Pos))

/**
 * @brief   Clear dummy cycle number (Only DMA Command Mode).
 * \hideinitializer
 */
#define SPIM_CLEAR_DMM_DC(spim) (spim->CTL2 &= ~(SPIM_CTL2_DC_DMM_Msk))

/**
 * @brief       Set output data for mode phase.
 * @param[in]   x   SPI Flash Continue Read Mode.
 *                  - \ref CMD_CLEAR_MODE_DATA
 *                  - \ref CMD_CONTINUE_READ_MODE
 * \hideinitializer
 */
#define SPIM_SET_MODE_DATA(spim, x) \
    (spim->MODE = ((spim->MODE & (~SPIM_MODE_MODEDATA_Msk)) | (x)))

/**
 * @brief   Get Read Data Mode.
 *
 */
#define SPIM_GET_MODE_DATA(spim) \
    ((spim->MODE & SPIM_MODE_MODEDATA_Msk) >> SPIM_MODE_MODEDATA_Pos)

/**
 * @brief   Clear output data for mode phase.
 * \hideinitializer
 */
#define SPIM_CLEAR_MODE_DATA(spim)  (spim->MODE &= ~(SPIM_MODE_MODEDATA_Msk))

