wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/inc/spim.h
/*----------------------------------------------------------------------------*/
/* SPIM_PHDMAW constant definitions                                           */
/*----------------------------------------------------------------------------*/
/**
 * @brief   Clear Phase DMA Write Setting.
 * \hideinitializer
 */
#define SPIM_CLEAR_PHDMAW(spim) (spim->PHDMAW &= ~(0xFFFFFFFF))

/**
 * @brief       Set Write Data Width for Command Phase.
 * @param[in]   x   Command Phase Witdh
 *                  - \ref PHASE_WIDTH_8
 *                  - \ref PHASE_WIDTH_16
 *                  - \ref PHASE_WIDTH_24
 *                  - \ref PHASE_WIDTH_32
 * \hideinitializer
 */
#define SPIM_SET_PHDMAW_CMD_WIDTH(spim, x)  \
    (spim->PHDMAW = (spim->PHDMAW & ~(SPIM_PHDMAW_DW_CMD_Msk)) | \
                    (x << SPIM_PHDMAW_DW_CMD_Pos))

/**
 * @brief   Get Write Data Width for Command Phase.
 * \hideinitializer
 */
#define SPIM_GET_PHDMAW_CMD_WIDTH(spim) \
    ((spim->PHDMAW & SPIM_PHDMAW_DW_CMD_Msk) >> SPIM_PHDMAW_DW_CMD_Pos)

/**
 * @brief   Set DTR Mode Enable Bit for Command Phase.
 * \hideinitializer
 */
#define SPIM_ENABLE_PHDMAW_CMD_DTR(spim)    (spim->PHDMAW |= SPIM_PHDMAW_DTR_CMD_Msk)

/**
 * @brief   Set DTR Mode Disable Bit for Command Phase.
 * \hideinitializer
 */
#define SPIM_DISABLE_PHDMAW_CMD_DTR(spim)   (spim->PHDMAW &= ~(SPIM_PHDMAW_DTR_CMD_Msk))

/**
 * @brief   Get DTR Mode Disable Bit for Command Phase.
 * \hideinitializer
 */
#define SPIM_GET_PHDMAW_CMD_DTR(spim)   \
    ((spim->PHDMAW & SPIM_PHDMAW_DTR_CMD_Msk) >> SPIM_PHDMAW_DTR_CMD_Pos)

/**
 * @brief       Set Bit Mode for Command Phase.
 * @param[in]   x   Command Phase Bits Mode.
 *                  - \ref PHASE_NORMAL_MODE
 *                  - \ref PHASE_DUAL_MODE
 *                  - \ref PHASE_QUAD_MODE
 *                  - \ref PHASE_OCTAL_MODE
 * \hideinitializer
 */
#define SPIM_SET_PHDMAW_CMD_BITMODE(spim, x)   \
    (spim->PHDMAW = (spim->PHDMAW & ~(SPIM_PHDMAW_BM_CMD_Msk)) | \
                    (x << SPIM_PHDMAW_BM_CMD_Pos))

/**
 * @brief   Get Bit Mode for Command Phase
 * \hideinitializer
 */
#define SPIM_GET_PHDMAW_CMD_BITMODE(spim) \
    ((spim->PHDMAW & SPIM_PHDMAW_BM_CMD_Msk) >> SPIM_PHDMAW_BM_CMD_Pos)

/**
 * @brief       Set Data Width for Address Phase.
 * @param[in]   x   Address Phase Witdh.
 *                  - \ref PHASE_WIDTH_8
 *                  - \ref PHASE_WIDTH_16
 *                  - \ref PHASE_WIDTH_24
 *                  - \ref PHASE_WIDTH_32
 * \hideinitializer
 */
#define SPIM_SET_PHDMAW_ADDR_WIDTH(spim, x) \
    (spim->PHDMAW = (spim->PHDMAW & ~(SPIM_PHDMAW_DW_ADDR_Msk)) | \
                    (x << SPIM_PHDMAW_DW_ADDR_Pos))

/**
 * @brief   Set Double Transfer Rate Mode Enable Bit for Address Phase.
 * \hideinitializer
 */
#define SPIM_ENABLE_PHDMAW_ADDR_DTR(spim)   (spim->PHDMAW |= (SPIM_PHDMAW_DTR_ADDR_Msk))

/**
 * @brief   Set Double Transfer Rate Mode Disable Bit for Address Phase.
 * \hideinitializer
 */
#define SPIM_DISABLE_PHDMAW_ADDR_DTR(spim)  (spim->PHDMAW &= ~(SPIM_PHDMAW_DTR_ADDR_Msk))

/**
 * @brief       Set SPI Interface Bit Mode for Address Phase.
 * @param[in]   x   Address Phase Bits Mode
 *                  - \ref PHASE_NORMAL_MODE
 *                  - \ref PHASE_DUAL_MODE
 *                  - \ref PHASE_QUAD_MODE
 *                  - \ref PHASE_OCTAL_MODE
 * \hideinitializer
 */
#define SPIM_SET_PHDMAW_ADDR_BITMODE(spim, x)  \
    (spim->PHDMAW = (spim->PHDMAW & ~(SPIM_PHDMAW_BM_ADDR_Msk)) | \
                    (x << SPIM_PHDMAW_BM_ADDR_Pos))

/**
 * @brief   Set Double Transfer Rate Mode Enable Bit for Data Phase.
 * \hideinitializer
 */
#define SPIM_ENABLE_PHDMAW_DATA_DTR(spim)   (spim->PHDMAW |= (SPIM_PHDMAW_DTR_DATA_Msk))

/**
 * @brief   Set Double Transfer Rate Mode Disable Bit for Data Phase.
 * \hideinitializer
 */
#define SPIM_DISABLE_PHDMAW_DATA_DTR(spim)  (spim->PHDMAW &= ~(SPIM_PHDMAW_DTR_DATA_Msk))

/**
 * @brief       Set Program Data Byte Order of Program Data Phase for Octal SPI Flash,.
 * @param[in]   x   Data Byte Order
 *                  - \ref PHASE_ORDER_MODE0 : Byte order byte0, byte1, byte2, byte3, byte4, byte5, byte6, byte7.
 *                  - \ref PHASE_ORDER_MODE1 : Byte order byte7, byte6, byte5, byte4, byte3, byte2, byte1, byte0.
 *                  - \ref PHASE_ORDER_MODE2 : Byte order byte1, byte0, byte3, byte2, byte5, byte4, byte7, byte6.
 *                  - \ref PHASE_ORDER_MODE3 : Byte order byte6, byte7, byte4, byte5, byte2, byte3, byte0, byte1.
 * \hideinitializer
 */
#define SPIM_SET_PHDMAW_PBO_DATA(spim, x)   \
    (spim->PHDMAW = (spim->PHDMAW & ~(SPIM_PHDMAW_PBO_DATA_Msk)) | \
                    (x << SPIM_PHDMAW_PBO_DATA_Pos))

/**
 * @brief       Set SPI Interface Bit Mode for Data Phase.
 * @param[in]   x   Data Phase Witdh.
 *                  - \ref PHASE_WIDTH_8
 *                  - \ref PHASE_WIDTH_16
 *                  - \ref PHASE_WIDTH_24
 *                  - \ref PHASE_WIDTH_32
 * \hideinitializer
 */
#define SPIM_SET_PHDMAW_DATA_BITMODE(spim, x)  \
    (spim->PHDMAW = (spim->PHDMAW & ~(SPIM_PHDMAW_BM_DATA_Msk)) | \
                    (x << SPIM_PHDMAW_BM_DATA_Pos))

/*----------------------------------------------------------------------------*/
/* SPIM_PHDMAR constant definitions                                           */
/*----------------------------------------------------------------------------*/
/**
 * @brief Clear PHDMAR Setting
 *
 */
#define SPIM_CLEAR_PHDMAR(spim) (spim->PHDMAR &= ~(0xFFFFFFFF))

/**
 * @brief       Set Read Data Width for Command Phase.
 * @param[in]   x   Command Phase Witdh.
 *                  - \ref PHASE_WIDTH_8
 *                  - \ref PHASE_WIDTH_16
 *                  - \ref PHASE_WIDTH_24
 *                  - \ref PHASE_WIDTH_32
 * \hideinitializer
 */
#define SPIM_SET_PHDMAR_CMD_WIDTH(spim, x)  \
    (spim->PHDMAR = (spim->PHDMAR & ~(SPIM_PHDMAR_DW_CMD_Msk)) | \
                    (x << SPIM_PHDMAR_DW_CMD_Pos))

/**
 * @brief   Get Read Data Width for Command Phase.
 * \hideinitializer
 */
#define SPIM_GET_PHDMAR_CMD_WIDTH(spim) \
    ((spim->PHDMAR & SPIM_PHDMAR_DW_CMD_Msk) >> SPIM_PHDMAR_DW_CMD_Pos)

/**
 * @brief   Enable Double Transfer Rate Mode for Command Phase.
 * \hideinitializer
 */
#define SPIM_ENABLE_PHDMAR_CMD_DTR(spim)    (spim->PHDMAR |= (SPIM_PHDMAR_DTR_CMD_Msk))

/**
 * @brief   Disable Double Transfer Rate Mode Bit for Command Phase.
 * \hideinitializer
 */
#define SPIM_DISABLE_PHDMAR_CMD_DTR(spim)   (spim->PHDMAR &= ~(SPIM_PHDMAR_DTR_CMD_Msk))

/**
 * @brief   Get Double Transfer Rate Mode Disable Bit for Command Phase.
 * \hideinitializer
 */
#define SPIM_GET_PHDMAR_CMD_DTR(spim)   \
    ((spim->PHDMAR & SPIM_PHDMAR_DTR_CMD_Msk) >> SPIM_PHDMAR_DTR_CMD_Pos)

/**
 * @brief       Set SPI Interface Bit Mode for Command Phase.
 * @param[in]   x   Command Phase Bits Mode
 *                  - \ref PHASE_NORMAL_MODE
 *                  - \ref PHASE_DUAL_MODE
 *                  - \ref PHASE_QUAD_MODE
 *                  - \ref PHASE_OCTAL_MODE
 * \hideinitializer
 */
#define SPIM_SET_PHDMAR_CMD_BITMODE(spim, x)   \
    (spim->PHDMAR = (spim->PHDMAR & ~(SPIM_PHDMAR_BM_CMD_Msk)) | \
                    (x << SPIM_PHDMAR_BM_CMD_Pos))

/**
 * @brief   Get SPI Interface Bit Mode for Command Phase.
 * \hideinitializer
 */
#define SPIM_GET_PHDMAR_CMD_BITMODE(spim)  \
    ((spim->PHDMAR & SPIM_PHDMAR_BM_CMD_Msk) >> SPIM_PHDMAR_BM_CMD_Pos)

/**
 * @brief   Set Data Width for Address Phase.
 * @param[in]   x   Addres Phase Witdh
 *                  - \ref PHASE_WIDTH_8
 *                  - \ref PHASE_WIDTH_16
 *                  - \ref PHASE_WIDTH_24
 *                  - \ref PHASE_WIDTH_32
 * \hideinitializer
 */
#define SPIM_SET_PHDMAR_ADDR_WIDTH(spim, x) \
    (spim->PHDMAR = (spim->PHDMAR & ~(SPIM_PHDMAR_DW_ADDR_Msk)) | \
                    (x << SPIM_PHDMAR_DW_ADDR_Pos))

/**
 * @brief   Enable Double Transfer Rate Mode for Address Phase.
 * \hideinitializer
 */
#define SPIM_ENABLE_PHDMAR_ADDR_DTR(spim)   (spim->PHDMAR |= (SPIM_PHDMAR_DTR_ADDR_Msk))

/**
 * @brief   Disable Double Transfer Rate Mode for Address Phase.
 * \hideinitializer
 */
#define SPIM_DISABLE_PHDMAR_ADDR_DTR(spim)  (spim->PHDMAR &= ~(SPIM_PHDMAR_DTR_ADDR_Msk))

/**
 * @brief       Set SPI Interface Bit Mode for Address Phase.
 * @param[in]   x   Addess Phase Bits Mode
 *                  - \ref PHASE_NORMAL_MODE
 *                  - \ref PHASE_DUAL_MODE
 *                  - \ref PHASE_QUAD_MODE
 *                  - \ref PHASE_OCTAL_MODE
 * \hideinitializer
 */
#define SPIM_SET_PHDMAR_ADDR_BITMODE(spim, x)  \
    (spim->PHDMAR = (spim->PHDMAR & ~(SPIM_PHDMAR_BM_ADDR_Msk)) | \
                    (x << SPIM_PHDMAR_BM_ADDR_Pos))

/**
 * @brief       Set Data Width for Mode Phase.
 * @param[in]   x   Read Mode Phase Witdh
 *                  - \ref PHASE_WIDTH_8
 *                  - \ref PHASE_WIDTH_16
 *                  - \ref PHASE_WIDTH_24
 *                  - \ref PHASE_WIDTH_32
 * \hideinitializer
 */
#define SPIM_SET_PHDMAR_READ_DATAWIDTH(spim, x)    \
    (spim->PHDMAR = (spim->PHDMAR & ~(SPIM_PHDMAR_DW_MODE_Msk)) | \
                    (x << SPIM_PHDMAR_DW_MODE_Pos))

/**
 * @brief   Enable Double Transfer Rate Mode for Read Mode Phase.
 * \hideinitializer
 */
#define SPIM_ENABLE_PHDMAR_READ_DTR(spim)   (spim->PHDMAR |= (SPIM_PHDMAR_DTR_MODE_Msk))

/**
 * @brief   Disable Double Transfer Rate Mode for Read Mode Phase.
 * \hideinitializer
 */
#define SPIM_DISABLE_PHDMAR_READ_DTR(spim)  (spim->PHDMAR &= ~(SPIM_PHDMAR_DTR_MODE_Msk))

/**
 * @brief       Set SPI Interface Bit Mode for Read Mode Phase.
 * @param[in]   x   Read Mode Phase Bits Mode
 *                  - \ref PHASE_NORMAL_MODE
 *                  - \ref PHASE_DUAL_MODE
 *                  - \ref PHASE_QUAD_MODE
 *                  - \ref PHASE_OCTAL_MODE
 * \hideinitializer
 */
#define SPIM_SET_PHDMAR_READ_BITMODE(spim, x)  \
    (spim->PHDMAR = (spim->PHDMAR & ~(SPIM_PHDMAR_BM_MODE_Msk)) | \
                    (x << SPIM_PHDMAR_BM_MODE_Pos))

/**
 * @brief   Enable Double Transfer Rate Mode for Data Phase.
 * \hideinitializer
 */
#define SPIM_ENABLE_PHDMAR_DATA_DTR(spim)   (spim->PHDMAR |= (SPIM_PHDMAR_DTR_DATA_Msk))

/**
 * @brief   Disable Double Transfer Rate Mode for Data Phase.
 * \hideinitializer
 */
#define SPIM_DISABLE_PHDMAR_DATA_DTR(spim)  (spim->PHDMAR &= ~(SPIM_PHDMAR_DTR_DATA_Msk))

/**
 * @brief   Enable Read DQS Mode for Data Phase.
 * \hideinitializer
 */
#define SPIM_ENABLE_PHDMAR_DATA_RDQS(spim)  (spim->PHDMAR |= (SPIM_PHDMAR_RDQS_DATA_Msk))

/**
 * @brief   Disable Read DQS Mode for Data Phase.
 * \hideinitializer
 */
#define SPIM_DISABLE_PHDMAR_DATA_RDQS(spim)  (spim->PHDMAR &= ~(SPIM_PHDMAR_RDQS_DATA_Msk))

/**
 * @brief       Set Received Data Byte Order of Received Data Phase for Octal SPI Flash.
 * @param[in]   x   Data Byte Order
 *                  - \ref PHASE_ORDER_MODE0 : Byte order byte0, byte1, byte2, byte3, byte4, byte5, byte6, byte7.
 *                  - \ref PHASE_ORDER_MODE1 : Byte order byte7, byte6, byte5, byte4, byte3, byte2, byte1, byte0.
 *                  - \ref PHASE_ORDER_MODE2 : Byte order byte1, byte0, byte3, byte2, byte5, byte4, byte7, byte6.
 *                  - \ref PHASE_ORDER_MODE3 : Byte order byte6, byte7, byte4, byte5, byte2, byte3, byte0, byte1.
 * \hideinitializer
 */
#define SPIM_SET_PHDMAR_RBO_DATA(spim, x)   \
    (spim->PHDMAR = (spim->PHDMAR & ~(SPIM_PHDMAR_RBO_DATA_Msk)) | \
                    (x << SPIM_PHDMAR_RBO_DATA_Pos))

/**
 * @brief       Set SPI Interface Bit Mode for Data Phase.
 * @param[in]   x   Data Phase Bits Mode
 *                  - \ref PHASE_NORMAL_MODE
 *                  - \ref PHASE_DUAL_MODE
 *                  - \ref PHASE_QUAD_MODE
 *                  - \ref PHASE_OCTAL_MODE
 * \hideinitializer
 */
#define SPIM_SET_PHDMAR_DATA_BITMODE(spim, x)  \
    (spim->PHDMAR = (spim->PHDMAR & ~(SPIM_PHDMAR_BM_DATA_Msk)) | \
                    (x << SPIM_PHDMAR_BM_DATA_Pos))

