wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/inc/spim.h
/*----------------------------------------------------------------------------*/
/* SPIM_PHDMM constant definitions                                            */
/*----------------------------------------------------------------------------*/
/**
 * @brief Clear PHDMM Setting
 *
 */
#define SPIM_CLEAR_PHDMM(spim)  (spim->PHDMM &= ~(0xFFFFFFFF))

/**
 * @brief       Set DMM Mode Data Width for Command Phase.
 * @param[in]   x   Command Phase Witdh
 *                  - \ref PHASE_WIDTH_8
 *                  - \ref PHASE_WIDTH_16
 *                  - \ref PHASE_WIDTH_24
 *                  - \ref PHASE_WIDTH_32
 * \hideinitializer
 */
#define SPIM_SET_PHDMM_CMD_WIDTH(spim, x)   \
    (spim->PHDMM = (spim->PHDMM & ~(SPIM_PHDMM_DW_CMD_Msk)) | \
                   (x << SPIM_PHDMM_DW_CMD_Pos))

/**
 * @brief   Get DMM Mode Data Width for Command Phase.
 * \hideinitializer
 */
#define SPIM_GET_PHDMM_CMD_WIDTH(spim)  \
    ((spim->PHDMM & SPIM_PHDMM_DW_CMD_Msk) >> SPIM_PHDMM_DW_CMD_Pos)

/**
 * @brief   Enable DMM Mode Double Transfer Rate Mode for Command Phase.
 * \hideinitializer
 */
#define SPIM_ENABLE_PHDMM_CMD_DTR(spim) (spim->PHDMM |= (SPIM_PHDMM_DTR_CMD_Msk))

/**
 * @brief   Disable DMM Mode Double Transfer Rate Mode for Command Phase.
 * \hideinitializer
 */
#define SPIM_DISABLE_PHDMM_CMD_DTR(spim)    (spim->PHDMM &= ~(SPIM_PHDMM_DTR_CMD_Msk))

/**
 * @brief   Get DMM Mode Double Transfer Rate Mode Enable Bit for Command Phase.
 * \hideinitializer
 */
#define SPIM_GET_PHDMM_CMD_DTR(spim)    \
    ((spim->PHDMM & SPIM_PHDMM_DTR_CMD_Msk) >> SPIM_PHDMM_DTR_CMD_Pos)

/**
 * @brief       Set SPI Interface Bit Mode for Command Phase,.
 * @param[in]   x   Command Phase Bits Mode
 *                  - \ref PHASE_NORMAL_MODE
 *                  - \ref PHASE_DUAL_MODE
 *                  - \ref PHASE_QUAD_MODE
 *                  - \ref PHASE_OCTAL_MODE
 * \hideinitializer
 */
#define SPIM_SET_PHDMM_CMD_BITMODE(spim, x)    \
    (spim->PHDMM = (spim->PHDMM & ~(SPIM_PHDMM_BM_CMD_Msk)) | \
                   (x << SPIM_PHDMM_BM_CMD_Pos))

/**
 * @brief   Get SPI Interface Bit Mode for Command Phase,.
 * \hideinitializer
 */
#define SPIM_GET_PHDMM_CMD_BITMODE(spim)   \
    ((spim->PHDMM & SPIM_PHDMM_BM_CMD_Msk) >> SPIM_PHDMM_BM_CMD_Pos)

/**
 * @brief       Set Data Width for Address Phase.
 * @param[in]   x   Set Address Width
 *                  - \ref PHASE_WIDTH_8
 *                  - \ref PHASE_WIDTH_16
 *                  - \ref PHASE_WIDTH_24
 *                  - \ref PHASE_WIDTH_32
 * \hideinitializer
 */
#define SPIM_SET_PHDMM_ADDR_WIDTH(spim, x)  \
    (spim->PHDMM = (spim->PHDMM & ~(SPIM_PHDMM_DW_ADDR_Msk)) | \
                   (x << SPIM_PHDMM_DW_ADDR_Pos))

/**
 * @brief   Enable Double Transfer Rate Mode for Address Phase.
 * \hideinitializer
 */
#define SPIM_ENABLE_PHDMM_ADDR_DTR(spim)    (spim->PHDMM |= (SPIM_PHDMM_DTR_ADDR_Msk))

/**
 * @brief   Disable Double Transfer Rate Mode for Address Phase.
 * \hideinitializer
 */
#define SPIM_DISABLE_PHDMM_ADDR_DTR(spim)   (spim->PHDMM &= ~(SPIM_PHDMM_DTR_ADDR_Msk))

/**
 * @brief       Set SPI Interface Bit Mode for Address Phase.
 * @param[in]   x   Address Phase Bit Mode
 *                  - \ref PHASE_NORMAL_MODE
 *                  - \ref PHASE_DUAL_MODE
 *                  - \ref PHASE_QUAD_MODE
 *                  - \ref PHASE_OCTAL_MODE
 * \hideinitializer
 */
#define SPIM_SET_PHDMM_ADDR_BITMODE(spim, x)   \
    (spim->PHDMM = (spim->PHDMM & ~(SPIM_PHDMM_BM_ADDR_Msk)) | \
                   (x << SPIM_PHDMM_BM_ADDR_Pos))

/**
 * @brief       Set Data Width for Mode Phase.
 * @param[in]   x   Read mode phase width
 *                  - \ref PHASE_WIDTH_8
 *                  - \ref PHASE_WIDTH_16
 *                  - \ref PHASE_WIDTH_24
 *                  - \ref PHASE_WIDTH_32
 * \hideinitializer
 */
#define SPIM_SET_PHDMM_READ_DATA_WIDTH(spim, x) \
    (spim->PHDMM = (spim->PHDMM & ~(SPIM_PHDMM_DW_MODE_Msk)) | \
                   (x << SPIM_PHDMM_DW_MODE_Pos))

/**
 * @brief   Enable Double Transfer Rate Mode for Mode Phase.
 * \hideinitializer
 */
#define SPIM_ENABLE_PHDMM_READ_DTR(spim)    (spim->PHDMM |= (SPIM_PHDMM_DTR_MODE_Msk))

/**
 * @brief   Disable Double Transfer Rate Mode for Mode Phase.
 * \hideinitializer
 */
#define SPIM_DISABLE_PHDMM_READ_DTR(spim)   (spim->PHDMM &= ~(SPIM_PHDMM_DTR_MODE_Msk))

/**
 * @brief       Set SPI Interface Bit Mode for Mode Phase.
 * @param[in]   x   Read Mode Phase Bit Mode
 *                  - \ref PHASE_NORMAL_MODE
 *                  - \ref PHASE_DUAL_MODE
 *                  - \ref PHASE_QUAD_MODE
 *                  - \ref PHASE_OCTAL_MODE
 * \hideinitializer
 */
#define SPIM_SET_PHDMM_READ_BITMODE(spim, x)   \
    (spim->PHDMM = (spim->PHDMM & ~(SPIM_PHDMM_BM_MODE_Msk)) | \
                   (x << SPIM_PHDMM_BM_MODE_Pos))

/**
 * @brief   Enable Double Transfer Rate Mode for Data Phase.
 * \hideinitializer
 */
#define SPIM_ENABLE_PHDMM_DATA_DTR(spim)    (spim->PHDMM |= (SPIM_PHDMM_DTR_DATA_Msk))

/**
 * @brief   Disable Double Transfer Rate Mode for Data Phase.
 * \hideinitializer
 */
#define SPIM_DISABLE_PHDMM_DATA_DTR(spim)   (spim->PHDMM &= ~(SPIM_PHDMM_DTR_DATA_Msk))

/**
 * @brief   Enable Read DQS Mode for Data Phase.
 * \hideinitializer
 */
#define SPIM_ENABLE_PHDMM_DATA_RDQS(spim)   (spim->PHDMM |= (SPIM_PHDMM_RDQS_DATA_Msk))

/**
 * @brief   Disable Read DQS Mode for Data Phase.
 * \hideinitializer
 */
#define SPIM_DISABLE_PHDMM_DATA_RDQS(spim)  (spim->PHDMM &= ~(SPIM_PHDMM_RDQS_DATA_Msk))

/**
 * @brief       Set Received Data Byte Order of Received Data Phase for Octal SPI Flash.
 * @param[in]   x   Data Byte Order
 *                  - \ref PHASE_ORDER_MODE0 : Byte order byte0, byte1, byte2, byte3, byte4, byte5, byte6, byte7.
 *                  - \ref PHASE_ORDER_MODE1 : Byte order byte7, byte6, byte5, byte4, byte3, byte2, byte1, byte0.
 *                  - \ref PHASE_ORDER_MODE2 : Byte order byte1, byte0, byte3, byte2, byte5, byte4, byte7, byte6.
 *                  - \ref PHASE_ORDER_MODE3 : Byte order byte6, byte7, byte4, byte5, byte2, byte3, byte0, byte1.
 * \hideinitializer
 */
#define SPIM_SET_PHDMM_RBO_DATA(spim, x)    \
    (spim->PHDMM = (spim->PHDMM & ~(SPIM_PHDMM_RBO_DATA_Msk)) | \
                   (x << SPIM_PHDMM_RBO_DATA_Pos))

/**
 * @brief       Set SPI Interface Bit Mode for Data Phase.
 * @param[in]   x   Read mode phase width
 *                  - \ref PHASE_WIDTH_8
 *                  - \ref PHASE_WIDTH_16
 *                  - \ref PHASE_WIDTH_24
 *                  - \ref PHASE_WIDTH_32
 * \hideinitializer
 */
#define SPIM_SET_PHDMM_DATA_BITMODE(spim, x)   \
    (spim->PHDMM = (spim->PHDMM & ~(SPIM_PHDMM_BM_DATA_Msk)) | \
                   (x << SPIM_PHDMM_BM_DATA_Pos))

