wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/inc/spim.h
/*----------------------------------------------------------------------------*/
/* SPIM_DLLx constant definitions                                            */
/*----------------------------------------------------------------------------*/
/**
 * @brief   Set DLL0 OLDO Enable Bit, 0: Disable, 1: Enable.
 * \hideinitializer
 */
#define SPIM_ENABLE_DLLOLDO(spim, x)  \
    (spim->DLL0 = (spim->DLL0 & ~(SPIM_DLL0_DLLOLDO_Msk)) | \
                  (((x) ? 1UL : 0UL) << SPIM_DLL0_DLLOLDO_Pos))

/**
 * @brief   Set DLL0 Output Valid Counter Reset.
 * \hideinitializer
 */
#define SPIM_ENABLE_DLLOVRST(spim, x) \
    (spim->DLL0 = (spim->DLL0 & ~(SPIM_DLL0_DLLOVRST_Msk)) | \
                  (((x) ? 1UL : 0UL) << SPIM_DLL0_DLLOVRST_Pos))

/**
 * @brief   Get DLL0 Output Valid Counter Reset Done.
 * \hideinitializer
 */
#define SPIM_GET_DLLOVRST(spim)  \
    ((spim->DLL0 & SPIM_DLL0_DLLOVRST_Msk) >> SPIM_DLL0_DLLOVRST_Pos)

/**
 * @brief   Get DLL0 Clock Divider Circuit Status Bit.
 * \hideinitializer
 */
#define SPIM_GET_DLLCLKON(spim)  \
    ((spim->DLL0 & SPIM_DLL0_DLLCLKON_Msk) >> SPIM_DLL0_DLLCLKON_Pos)

/**
 * @brief   Get DLL0 Lock Status Bit.
 * \hideinitializer
 */
#define SPIM_GET_DLLLOCK(spim)   \
    ((spim->DLL0 & SPIM_DLL0_DLLLOCK_Msk) >> SPIM_DLL0_DLLLOCK_Pos)

/**
 * @brief   Get DLL0 Output Ready Status.
 * \hideinitializer
 */
#define SPIM_GET_DLLREADY(spim)  \
    ((spim->DLL0 & SPIM_DLL0_DLLREADY_Msk) >> SPIM_DLL0_DLLREADY_Pos)

/**
 * @brief   Get DLL0 Refresh Status Bit.
 * \hideinitializer
 */
#define SPIM_GET_DLLREF(spim)    \
    ((spim->DLL0 & SPIM_DLL0_DLL_REF_Msk) >> SPIM_DLL0_DLL_REF_Pos)

/**
 * @brief   Set DLL0 Delay Step Number. It could be 0 ~ 0x1F.
 * \hideinitializer
 */
#define SPIM_SET_DLLDLY_NUM(spim, x)    \
    (spim->DLL0 = (spim->DLL0 & ~(SPIM_DLL0_DLL_DNUM_Msk)) | \
                  ((x) << SPIM_DLL0_DLL_DNUM_Pos))

/**
 * @brief   Set Clock Cycle Number between DLL Lock and DLL Output Valid,
 *          It could be 0 ~ 0xFFFF.
 * \hideinitializer
 */
#define SPIM_SET_DLLOV_NUM(spim, x)    \
    (spim->DLL1 = (spim->DLL1 & ~(SPIM_DLL1_DLLOVNUM_Msk)) | \
                  ((x) << SPIM_DLL1_DLLOVNUM_Pos))

/**
 * @brief   Get Cycle Number of DLL1 Ouput Valid. It could be 0 ~ 0xFFFF.
 * \hideinitializer
 */
#define SPIM_GET_DLLOV_NUM(spim) \
    ((spim->DLL1 & SPIM_DLL1_DLLOVNUM_Msk) >> SPIM_DLL1_DLLOVNUM_Pos)

/**
 * @brief   Set Cycle Number between DLL Clock Divider Enable and DLL Lock Valid.
 *          It could be 0 ~ 0xFFFF.
 * \hideinitializer
 */
#define SPIM_SET_DLLLOCK_NUM(spim, x)  \
    (spim->DLL1 = (spim->DLL1 & ~(SPIM_DLL1_DLLLKNUM_Msk)) | \
                  ((x) << SPIM_DLL1_DLLLKNUM_Pos))

/**
 * @brief   Get Cycle Number between DLL Clock Divider Enable and DLL Lock Valid.
 * \hideinitializer
 */
#define SPIM_GET_DLLLOCK_NUM(spim) \
    ((spim->DLL1 & SPIM_DLL1_DLLLKNUM_Msk) >> SPIM_DLL1_DLLLKNUM_Pos)

/**
 * @brief   Set Cycle Number of between DLL Output Valid and DLL Auto Trim Enable Time.
 *          It could be 0 ~ 0xFFFF.
 * \hideinitializer
 */
#define SPIM_SET_DLLTRIM_NUM(spim, x) \
    (spim->DLL2 = (spim->DLL2 & ~(SPIM_DLL2_TRIMNUM_Msk)) | \
                  ((x) << SPIM_DLL2_TRIMNUM_Pos))

/**
 * @brief   Set Cycle Number of between DLL OLDO Enable and DLL Clock Divider Enable Time.
 *          It could be 0 ~ 0xFFFF.
 * \hideinitializer
 */
#define SPIM_SET_DLLCLKON_NUM(spim, x)    \
    (spim->DLL2 = (spim->DLL2 & ~(SPIM_DLL2_CLKONNUM_Msk)) | \
                  ((x) << SPIM_DLL2_CLKONNUM_Pos))

/*----------------------------------------------------------------------------*/
/* static inline functions                                                    */
/*----------------------------------------------------------------------------*/
__STATIC_INLINE void SPIM_DISABLE_CIPHER(SPIM_T *spim);
__STATIC_INLINE void SPIM_ENABLE_CIPHER(SPIM_T *spim);

__STATIC_INLINE void SPIM_DISABLE_CACHE(SPIM_T *spim);
__STATIC_INLINE void SPIM_ENABLE_CACHE(SPIM_T *spim);

__STATIC_INLINE uint32_t SPIM_GetDMMAddress(SPIM_T *spim);

/**
 * @brief   Enable cipher.
 *
 * @param spim
 * @note    When encryption/decryption of SPIM is enabled,
 *          please set SPIM_SET_DMM_DESELTIM() >= 0x10.
 */
__STATIC_INLINE void SPIM_ENABLE_CIPHER(SPIM_T *spim)
{
    spim->CTL0 &= ~(SPIM_CTL0_CIPHOFF_Msk | SPIM_CTL0_BALEN_Msk);

    SPIM_SET_DMM_DESELTIM(spim, 0x12);
}

/**
 * @brief   Disable cipher.
 *
 * @param spim
 * @note    When encryption/decryption of SPIM is disabled,
 *          please set SPIM_SET_DMM_DESELTIM >= 0x8.
 */
__STATIC_INLINE void SPIM_DISABLE_CIPHER(SPIM_T *spim)
{
    spim->CTL0 |= (SPIM_CTL0_BALEN_Msk | SPIM_CTL0_CIPHOFF_Msk);

    SPIM_SET_DMM_DESELTIM(spim, 0x08);
}

/**
 * @brief   Disable cache.
 *
 * @param spim
 * @note    Minimum time width of SPIM_SS
 *          deselect time = (DESELTIM + 1) * AHB clock cycle time.
 */
__STATIC_INLINE void SPIM_DISABLE_CACHE(SPIM_T *spim)
{
#if (SPIM_REG_CACHE == 1) //TESTCHIP_ONLY not support
    (spim->CTL1 |= SPIM_CTL1_CACHEOFF_Msk);
#endif

    /* Cipher Disabled Set Deselect Time 0x01 */
    if (((spim->CTL0 & SPIM_CTL0_CIPHOFF_Msk) >> SPIM_CTL0_CIPHOFF_Pos) != SPIM_OP_DISABLE)
    {
        SPIM_SET_DMM_DESELTIM(spim, 0x1);
    }
}

/**
 * @brief   Enable cache.
 *
 * @param spim
 * @note    Minimum time width of SPIM_SS
 *          deselect time = (DESELTIM + 4) * AHB clock cycle time.
 */
__STATIC_INLINE void SPIM_ENABLE_CACHE(SPIM_T *spim)
{
#if (SPIM_REG_CACHE == 1) // TESTCHIP_ONLY not support
    (spim->CTL1 &= ~(SPIM_CTL1_CACHEOFF_Msk));

    /* Cipher Disabled Set Deselect Time 0x04 */
    if (((spim->CTL0 & SPIM_CTL0_CIPHOFF_Msk) >> SPIM_CTL0_CIPHOFF_Pos) != SPIM_OP_DISABLE)
    {
        SPIM_SET_DMM_DESELTIM(spim, 0x4);
    }

#endif
}

/**
  * @brief      Get Direct Map Address.
  * @param      spim
  * @return     Direct Mapping Address
  */
__STATIC_INLINE uint32_t SPIM_GetDMMAddress(SPIM_T *spim)
{
    uint32_t u32DMMAddr = 0;

    if (spim == SPIM0)
    {
        u32DMMAddr = SPIM_DMM0_ADDR;
    }
    else if (spim == SPIM1) // TESTCHIP_ONLY
    {
        u32DMMAddr = SPIM_DMM1_ADDR;
    }

