wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/inc/spim.h
    return u32DMMAddr;
}

/** @addtogroup SPIM_EXPORTED_TYPEDEF SPIM Exported Type Defines
  @{
*/
typedef struct
{
    uint32_t u32CMDCode;        /*!< Page Program Command Code */

    uint32_t u32CMDPhase;       /*!< Command phase mode */
    uint32_t u32CMDWidth;       /*!< Command Width */
    uint32_t u32CMDDTR;         /*!< Command use DTR mode */

    uint32_t u32AddrPhase;      /*!< Address phase mode */
    uint32_t u32AddrWidth;      /*!< Address Width */
    uint32_t u32AddrDTR;        /*!< Address use DTR mode */

    uint32_t u32DataPhase;      /*!< Data phase mode */
    uint32_t u32ByteOrder;      /*!< Data Byte Order */
    uint32_t u32DataDTR;        /*!< Data use DTR mode */
    uint32_t u32RDQS;           /*!< Receive data from SPI Flash when read DQS*/

    uint32_t u32DcNum;          /*!< Dummy `cycle count */

    /* Continue read mode only support 0xBB, 0xEB, 0xE7, 0x0D, 0xBD, and 0xED
       in Direct Map Mode */
    uint32_t u32ContRdEn;       /*!< Enable Continue Read mode */
    uint32_t u32RdModePhase;    /*!< Read mode phase mode */
    uint32_t u32RdModeWidth;    /*!< Read mode phase mode */
    uint32_t u32RdModeDTR;      /*!< Read mode use DTR mode */

} SPIM_PHASE_T;  /*!< Structure holds SPIM IO phase info */

/** @addtogroup SPIM HYPER_EXPORTED_CONSTANTS HYPER Exported Constants
  @{
*/

/** @} end of group SPIM_EXPORTED_CONSTANTS */

/** @addtogroup SPIM_EXPORTED_FUNCTIONS SPIM Exported Functions
  @{
*/

/* Octal SPI flash and hyper device training DLL API */
int32_t SPIM_SetDLLDelayNum(SPIM_T *spim, uint32_t u32DelayNum);

/*----------------------------------------------------------------------------*/
/* SPIM Define Function Prototypes                                            */
/*----------------------------------------------------------------------------*/
int32_t SPIM_InitFlash(SPIM_T *spim, int clrWP);
uint32_t SPIM_GetSClkFreq(SPIM_T *spim);
void SPIM_ReadJedecId(SPIM_T *spim, uint8_t *idBuf, uint32_t u32NRx, uint32_t u32NBit, uint32_t u32DcNum);
int32_t SPIM_Enable_4Bytes_Mode(SPIM_T *spim, int isEn, uint32_t u32NBit);
int32_t SPIM_Is4ByteModeEnable(SPIM_T *spim, uint32_t u32NBit);
int32_t SPIM_SetWrapAroundEnable(SPIM_T *spim, int isEn);
void SPIM_SetWriteEnable(SPIM_T *spim, int isEn, uint32_t u32NBit);

void SPIM_ReadStatusRegister(SPIM_T *spim, uint8_t dataBuf[], uint32_t u32NRx, uint32_t u32NBit);
void SPIM_ReadConfigRegister(SPIM_T *spim, uint8_t u8RdCMD, uint32_t u32Addr, uint8_t *pu8DataBuf, uint32_t u32NRx, uint32_t u32NBit);
void SPIM_WriteConfigRegister(SPIM_T *spim, uint8_t u8CMD, uint32_t u32Addr, uint8_t u8Data, uint32_t u32NBit);

void SPIM_ChipErase(SPIM_T *spim, uint32_t u32NBit, int isSync);
void SPIM_EraseBlock(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr, uint8_t u8ErsCmd, uint32_t u32NBit, int isSync);

void SPIM_IO_Write(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr, uint32_t u32NTx,
                   uint8_t *pu8TxBuf, uint8_t wrCmd, uint32_t u32NBitCmd,
                   uint32_t u32NBitAddr, uint32_t u32NBitDat);
void SPIM_IO_Read(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr, uint32_t u32RdSize,
                  uint8_t *pu8RxBuf, uint8_t rdCmd, uint32_t u32NBitCmd,
                  uint32_t u32NBitAddr, uint32_t u32NBitDat, int u32NDummy);

void SPIM_DMA_Write(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr, uint32_t u32NTx, uint8_t *pu8TxBuf, uint32_t wrCmd);
int32_t SPIM_DMA_Read(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr, uint32_t u32NRx, uint8_t *pu8RxBuf, uint32_t u32RdCmd, int isSync);

void SPIM_EnterDirectMapMode(SPIM_T *spim, int is4ByteAddr, uint32_t u32RdCmd, uint32_t u32IdleIntvl);
void SPIM_ExitDirectMapMode(SPIM_T *spim);

int32_t SPIM_SetContReadDisable(SPIM_T *spim);

void SPIM_SetQuadEnable(SPIM_T *spim, int isEn, uint32_t u32NBit);

void SPIM_WinbondUnlock(SPIM_T *spim, uint32_t u32NBit);

/* PHDMAW/PHDMAR/PHDMM Register Settings for DMA Read/DMA Write/DMM Read */
void SPIM_DMADMM_SetRWDQS(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32RdDQS);

/* Phase table init API, Phase Table Setting reference SPI Flash specification. */
void SPIM_DMADMM_InitPhase(SPIM_T *spim, SPIM_PHASE_T *psPhaseTable, uint32_t u32OPMode);

/* convert PHASE_MODE to Bit mode */
uint32_t SPIM_PhaseModeToNBit(uint32_t u32Phase);

/* Normal I/O send command phase. */
void SPIM_IO_SendCMDPhase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32OpCMD, uint32_t u32CMDPhase, uint32_t u32DTREn);
/* Normal I/O send address phase. */
void SPIM_IO_SendAddrPhase(SPIM_T *spim, uint32_t u32Is4ByteAddr, uint32_t u32Addr, uint32_t u32AddrPhase, uint32_t u32DTREn);
/* Normal I/O send dummy cycle. */
int32_t SPIM_IO_SendDummyCycle(SPIM_T *spim, int u32NDummy);
/* Normal I/O send data phase. */
void SPIM_IO_SendDataPhase(SPIM_T *spim, uint32_t u32OPMode, uint8_t *pu8TRxBuf, uint32_t u32TRxSize, uint32_t u32DataPhase, uint32_t u32DTREn);

/* Phase table use normal I/O write */
void SPIM_IO_WritePhase(SPIM_T *spim, SPIM_PHASE_T *psPhaseTable, uint32_t u32Addr, uint8_t *pu8RxBuf, uint32_t u32WrSize);
/* Phase table use normal I/O read */
void SPIM_IO_ReadPhase(SPIM_T *spim, SPIM_PHASE_T *psPhaseTable, uint32_t u32Addr, uint8_t *pu8RxBuf, uint32_t u32RdSize);

/** @} end of group SPIM_EXPORTED_FUNCTIONS */
/** @} end of group SPIM_Driver */
/** @} end of group Standard_Driver */

#ifdef __cplusplus
}
#endif

#endif /* __SPIM_H__ */
